turbulenceOptimizer/app/constant/optProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      optProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

raa0                1e-5;
voluse              0.4;
mma_init            0.3;
mma_dec             0.5;
mma_inc             1.05;
movlim              0.08;
filterR             2.5;
PowerDiss0          7e-7;
PowerDissMax        25;
PowerDissRelax      50;
GeoDim              2;
fluid_area          yes;
solid_area          no;
test_area           no;
Pnorm               300;
objFunction         3;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //  
