turbulenceOptimizer/app/constant/tuneOptParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      tuneOptParameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convergenceControl
{
    // User-facing controls only. Advanced/internal controls are intentionally
    // omitted here and use validated defaults from source code.
    optRunMode production;         // `production` or `diagnostic`.

    // Basic convergence and stop behavior
    optMinIterations    50;
    optStallWindow      5;
    optObjectiveTol     1e-3;
    optConstraintTol    1e-3;
    optStepTol          5e-3;

    // Step-acceptance/globalization controller retired by design.

    // MMA trust-constrained behavior
    optAdaptiveBaseMoveMin 0.08;
    optAdaptiveBaseMoveMax 0.20;
    optAdaptiveAsymIncMin 1.02;
    optAdaptiveAsymIncMax 1.08;
    optAdaptiveAsymDecMin 0.40;
    optAdaptiveAsymDecMax 0.60;
    optMmaMoveLimitFloor 1e-2;
    optRecoveryEnable false;
    optLaminarReferenceWarmupIterations 20;
    optLaminarReferenceWarmupMoveLimit 0.15;
    optLaminarReferenceWarmupResidualGrowthLimit 3.0;
    optProductionIgnoreSensitivityReject true;
    optProductionContinueAfterSafetyReject true;

    // Thermal objective/constraints (user physical targets)
    optThermalExcessTref 1.0;
    optThermalExcessSoftplusScale 0.5;
    optThermalTmaxLimit 15.0;
    optThermalTminLimit 0.0;
    optThermalKSBeta    24.0;

    // Diagnostics toggles
    optGradientCheckEnable               true;
    optClosureDerivativeFDEnable         true;
    optClosureDerivativeFDStageCheckEnable true;
    optPersistFirstFailureSnapshot       true;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
